# AnaxDb
<b>An encrypted non-linear database based on Pandas</b><br>
<i>"The first man to discover infinity"</i>

### Features
- Pandas syntax
- Non-linear reads / writes. [All operations executed in Numpy tensors]
- Tiny storage footprint. [Parquet columnwise compression] 
- Enterprise grade AES encryption
- Choose local or object storage backend

### Getting Started

This example targets the advanced user, so Anax's object storage backend will be used. Anax's config.ini was populated ahead of time with the object storage endpoint and credential details.

If you would like to get started without worrying about this, just bootstrap the database and start the connection with local storage.

### Import AnaxDb

In [1]:
import anax

### Bootstrap a new Anax Database

In [2]:
# Wipe and build fresh database in local folder
#anax.Database(bootstrap=True);

# Wipe and build fresh database in object storage
anax.Database(bootstrap=True, object_storage=True);

### Connect to the Anax Database

In [3]:
# Local storage
#anax = anax.Database()

# Object Storage
anax = anax.Database(object_storage=True)

### List tables
An initial table called "users" is created during bootstrap. This table name and details can be modified in config.ini.

In [4]:
anax.tables()

['users']

### Read a table

In [5]:
anax.read("users")

,uid,username,email,password,admin
0,b88736c33826463a93f47c9b370e392c,admin,admin@example.com,YWRtaW4=,True

### Create a table

In [6]:
my_numbers = [1,2,3,4,5]
my_table = {"my_numbers": my_numbers}

In [7]:
anax.create("my_table", my_table)

In [8]:
anax.tables()

['my_table', 'users']

In [9]:
anax.read("my_table")

   my_numbers
0           1
1           2
2           3
3           4
4           5

### Anax syntax :: Select

In [10]:
my_table = anax.read("my_table")

"my_table" is now a Pandas Dataframe object! Use pandas syntax to interact with it.

In [11]:
# Pandas specific syntax
my_table[my_table.my_numbers == 3]

   my_numbers
2           3

In [12]:
# More Pandas specific syntax
my_table.loc[my_table.my_numbers == 3,]

   my_numbers
2           3

In [13]:
# SQL-like syntax with variables
num = 3
my_table.query("my_numbers == @num")

   my_numbers
2           3

### Modify a Table

In [14]:
# Change "3" to "13"
my_table.loc[my_table.my_numbers == 3,] = 13
my_table

   my_numbers
0           1
1           2
2          13
3           4
4           5

### Write changes to database

In [15]:
anax.write(my_table, "my_table")

### Verify changes

In [16]:
anax.read("my_table")

   my_numbers
0           1
1           2
2          13
3           4
4           5